app/views/homepage/index.html.erb

SELECT "programs".* FROM "programs"
---
      <div class="large-4 small-6 columns">
        <%= image_tag(program.program_images.first.attachment.url(:original), :width=>'250px') unless program.program_images.blank? %>