app/controllers/admin/programs_controller.rb

  def show
    @program = Program.find(params[:id])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT 1  [["id", "curso-de-analisis-sensorial-en-quito"]]