app/controllers/admin/programs_controller.rb

SELECT "programs".* FROM "programs" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "programs"
---
  def index
    @programs = Program.page(params[:page]).per(10)

INSERT INTO "programs" ("cached_slug", "created_at", "description", "end_date", "name", "price", "start_date", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @program = Program.new(params[:program])
    respond_to do |format|
      if @program.save