app/controllers/homepage_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    @title = "Servicios de asesoría en Ecuador y Colombia"
    @programs = Program.limit(3)